In [1]:
import pandas as pd

link to schema/dataset https://www.kaggle.com/datasets/rtatman/lego-database/data?select=downloads_schema.png

![Data Schema](https://storage.googleapis.com/kagglesdsdata/datasets/1599/2846/downloads_schema.png?X-Goog-Algorithm=GOOG4-RSA-SHA256&X-Goog-Credential=gcp-kaggle-com%40kaggle-161607.iam.gserviceaccount.com%2F20231212%2Fauto%2Fstorage%2Fgoog4_request&X-Goog-Date=20231212T234545Z&X-Goog-Expires=259200&X-Goog-SignedHeaders=host&X-Goog-Signature=53b3e47decb23e7f1baeea65238470213dd97fbf1d92a993800438de28dcba7cf6e814c0b9e87f0dc82f4ad98119a5cf10df5cd2b7d7b48721f8e0171202ceb6f4b43a2d50695567fc37d2ab8751a9ff272202a95cadbbbf93e02a8a2734115b047100e63d4c31c09a09c0d649c4bdd5f2255bf939a242935b17ccebc9210dd11f992cd427d19567d3f21ec8cc252f817a22cf7b566db5589d76b80f9b12f8b2f92618c144ea711efbba3ee61d8d09a87a1e29185ad9741868c3fefcb73d2d9451b2a0dd76c44d70a16b6f7f519cef7085deea8b3c4adae6e2a547bad76a511ef27b6fbf9c7d56ce8de9cb650eee43ecc65d78bc2166b1f2490630332a8c8837)

In [2]:
inventories_df = pd.read_csv(r'inventories.csv')
inventory_parts_df = pd.read_csv(r'inventory_parts.csv')
inventory_sets_df = pd.read_csv(r'inventory_sets.csv')
part_categories_df = pd.read_csv(r'part_categories.csv')
parts_df = pd.read_csv(r'parts.csv')
sets_df = pd.read_csv(r'sets.csv')
themes_df = pd.read_csv(r'themes.csv')
colors_df = pd.read_csv(r'colors.csv')

In [3]:
themes_df.isna().sum()

id             0
name           0
parent_id    111
dtype: int64

In [4]:
themes_df.head()

   id            name  parent_id
0   1         Technic        NaN
1   2  Arctic Technic        1.0
2   3     Competition        1.0
3   4  Expert Builder        1.0
4   5           Model        1.0

In [5]:
themes_df['parent_id'].unique()

array([ nan,   1.,   5.,  22.,  23.,  38.,  50.,  52.,  67.,  94., 105.,
       112., 123., 126., 147., 148., 155., 158., 159., 171., 180., 186.,
       204., 206., 207., 217., 227., 233., 236., 241., 246., 252., 254.,
       258., 264., 273., 276., 279., 280., 287., 290., 296., 302., 304.,
       307., 315., 318., 324., 365., 373., 390., 400., 408., 411., 425.,
       435., 443., 454., 458., 465., 475., 478., 482., 484., 494., 497.,
       501., 504., 507., 518., 524., 529., 535., 561., 562., 566., 571.,
       580., 591.])

In [6]:
themes_df['id'].unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
       105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
       118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
       131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143,
       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156,
       157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169,
       170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182,
       183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195,
       196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208,
       209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221,
       222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234,
       235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247,
       248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260,
       261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273,
       274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286,
       287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299,
       300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312,
       313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325,
       326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338,
       339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351,
       352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364,
       365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377,
       378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390,
       391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403,
       404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416,
       417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429,
       430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442,
       443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455,
       456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468,
       469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481,
       482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494,
       495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506, 507,
       508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520,
       521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533,
       534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545, 546,
       547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559,
       560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571, 572,
       573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584, 585,
       586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598,
       599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 611,
       612, 613, 614], dtype=int64)

In [7]:
sets_df.head()

  set_num                        name  year  theme_id  num_parts
0    00-1             Weetabix Castle  1970       414        471
1  0011-2           Town Mini-Figures  1978        84         12
2  0011-3  Castle 2 for 1 Bonus Offer  1987       199          2
3  0012-1          Space Mini-Figures  1979       143         12
4  0013-1          Space Mini-Figures  1979       143         12

In [8]:
sets_df['theme_id'].unique()

array([414,  84, 199, 143, 186, 413, 366,  67, 502, 469, 233, 254, 243,
       238, 158, 174, 236, 404, 237, 324, 276, 172, 239, 387,  75, 147,
        85, 206, 255, 227, 229, 256, 488, 257, 500, 231, 459, 169, 461,
       246, 278, 244,  53,  68, 301, 197, 155, 397, 104, 173, 193, 240,
       165, 347, 153, 443, 175, 196, 171, 558, 156, 568,  38,  22, 228,
       297,  43, 259, 416, 456,   1, 473, 532, 511, 510, 504,  81, 533,
       506, 471, 579, 505, 534,  79,  20, 365,  37, 591, 507,  87,  77,
       482, 496, 494, 207, 217, 528, 484, 311,  82,  92, 434, 423, 517,
       470, 235, 433, 453, 100,  93, 497, 435, 126, 135, 458, 400, 372,
       125, 452, 390, 371,  14,  50,  60,  91,  99,  13,  11,  12, 368,
       299, 442, 298,  16, 212, 221, 370, 524, 525, 273, 274, 391, 355,
       356, 305, 462, 329, 282, 129, 190, 148,  76, 466,  69, 467, 136,
       188, 130, 447,  70, 412, 364, 203,  80, 132,  72, 468, 363,  74,
       559, 194, 133, 142, 399,  83, 308, 131, 201,  90,  86, 145, 464,
       128,  78, 140,  58, 265, 432, 398, 162, 161, 316, 163, 271, 501,
       160, 232, 401, 252, 253, 576, 577, 590, 138, 309, 403,  59, 103,
       405, 383, 600, 134, 195, 144, 323, 605, 208, 220, 477, 141,  63,
        56, 332, 598,   3, 178,  61,  52,  23, 120, 123, 315, 164, 275,
       437, 495, 269, 263, 127, 487, 490,  30, 114, 566, 563, 564,  55,
       146, 159, 571, 575, 570, 184, 578,  31,  65, 374, 602, 295, 375,
       493, 230, 185, 376,  97, 603,  42,  39,  40,  32, 377, 378, 262,
       379, 451, 367, 204, 380, 346, 408, 381, 216, 226, 382, 166, 300,
       420, 109, 407, 460, 417, 480, 421, 422, 392, 393, 394, 395, 396,
       419, 415, 418, 200, 189, 388, 260, 463, 272, 317, 410, 389, 503,
       409, 411, 425,  26, 157, 154, 277,  24, 214, 223, 106, 406, 289,
       610, 581, 582, 583, 584, 585, 586, 587, 588, 589,   7,   6,  15,
         9, 119, 113, 478, 279, 479,  48,  64, 167, 526, 258, 492, 521,
       518, 439, 121, 117, 124, 170, 281, 283, 284, 285, 291, 292, 293,
       294, 251, 247, 306, 250, 248, 288, 342, 205,  41,  57, 198,  44,
        45,  46, 565, 535, 176, 177, 489, 486, 483, 182, 601, 303, 599,
       369, 454, 449, 446, 445,  19, 457, 249, 444, 560, 137,  71, 319,
       322, 320, 321, 481,  25, 386,  54,  66, 187, 614, 191, 202, 314,
       313, 312, 168, 152, 149, 151, 150, 215, 224, 102,  95, 101,  88,
        73,  98,  96,  89, 328,  18,  51, 344, 335, 353, 357, 116, 349,
       341, 350, 351, 476,  47, 304, 139, 491, 572, 513, 574, 474, 573,
       242, 111, 107, 108, 110, 436, 286, 360, 362, 361, 544, 523, 545,
       547, 549, 550, 548, 551, 552, 554, 555, 556, 557, 611, 608, 345,
       604, 402,  33, 267, 266, 268, 234,  62, 384, 385, 245, 180, 181,
       209, 225, 183, 612, 179, 213, 222, 606, 607, 210, 218, 485, 112,
       310, 499,  34, 567, 569, 211, 219, 472,  21,   8,   5, 118, 115,
        10,  17, 438, 122, 270,   4, 348, 343, 354, 330, 336,   2, 302,
       536, 537, 339, 338, 359, 337, 358, 538, 539, 540, 541, 542, 543,
       498, 340, 546, 352, 326, 334, 327, 333, 325, 331, 455, 514, 508,
       515, 527, 512, 509, 529, 531, 520, 261, 530, 519, 427, 426, 562,
       475, 264, 430], dtype=int64)

In [9]:
parts_df.head()

  part_num                                               name  part_cat_id
0   0687b1                        Set 0687 Activity Booklet 1           17
1     0901  Baseplate 16 x 30 with Set 080 Yellow House Print            1
2     0902  Baseplate 16 x 24 with Set 080 Small White Hou...            1
3     0903     Baseplate 16 x 24 with Set 080 Red House Print            1
4     0904  Baseplate 16 x 24 with Set 080 Large White Hou...            1

In [10]:
parts_df.isna().sum()

part_num       0
name           0
part_cat_id    0
dtype: int64

In [11]:
parts_df.shape

(25993, 3)

In [12]:
part_categories_df.head()

   id                     name
0   1               Baseplates
1   2           Bricks Printed
2   3            Bricks Sloped
3   4  Duplo, Quatro and Primo
4   5           Bricks Special

In [13]:
part_categories_df.shape

(57, 2)

In [14]:
part_categories_df.isna().sum()

id      0
name    0
dtype: int64

No missing values so lets merge

In [15]:
part_cat_part_df=pd.merge(parts_df, part_categories_df, left_on='part_cat_id', right_on='id')

In [16]:
part_cat_part_df.shape

(25993, 5)

Now looking at inventory parts

In [17]:
inventory_parts_df.head()

   inventory_id     part_num  color_id  quantity is_spare
0             1     48379c01        72         1        f
1             1        48395         7         1        f
2             1     mcsport6        25         1        f
3             1       paddle         0         1        f
4             3  11816pr0005        78         1        f

In [18]:
inventory_parts_df.isna().sum()

inventory_id    0
part_num        0
color_id        0
quantity        0
is_spare        0
dtype: int64

In [19]:
inventory_parts_df.shape

(580251, 5)

No missing so lets merge inventory_id with part_cat_part_df

In [20]:
part_cat_part_df.head(1)

  part_num                       name_x  part_cat_id  id    name_y
0   0687b1  Set 0687 Activity Booklet 1           17  17  Non-LEGO

In [21]:
inventory_parts_df.head(1)

   inventory_id  part_num  color_id  quantity is_spare
0             1  48379c01        72         1        f

In [22]:
inventory_with_parts=pd.merge(inventory_parts_df, part_cat_part_df, left_on='inventory_id', right_on='part_cat_id')

In [23]:
inventory_with_parts.head(1)

,inventory_id,part_num_x,color_id,quantity,is_spare,part_num_y,name_x,part_cat_id,id,name_y
0,1,48379c01,72,1,f,0901,Baseplate 16 x 30 with Set 080 Yellow House Print,1,1,Baseplates

In [24]:
#in the above join im noticing a lot of the data got deleted because of the join.
inventory_with_parts.shape

(363337, 10)

Lets carry on for now. Merging colors now with our ongoing dataset

In [25]:
colors_df.shape

(135, 4)

In [26]:
colors_df.isna().sum()

id          0
name        0
rgb         0
is_trans    0
dtype: int64

no missing values, joining now on colors id

In [27]:
inventory_with_color=pd.merge(inventory_with_parts, colors_df, left_on='color_id', right_on='id')

In [28]:
inventory_with_color.head(1)

,inventory_id,part_num_x,color_id,quantity,is_spare,part_num_y,name_x,part_cat_id,id_x,name_y,id_y,name,rgb,is_trans
0,1,48379c01,72,1,f,0901,Baseplate 16 x 30 with Set 080 Yellow House Print,1,1,Baseplates,72,Dark Bluish Gray,6C6E68,f